aalib
abseil-cpp
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
akonadi-mime
alacritty
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
apparmor
archlinux-keyring
argon2
at-spi2-core
atkmm
attica
attica5
attr
audit
augeas
autoconf
automake
avahi
base
base-devel
bash
bat
binutils
bison
bleachbit
bridge-utils
brightnessctl
brotli
btop
btrfs-progs
bubblewrap
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
capstone
cdparanoia
cjson
cliphist
cmatrix
coreutils
cpio
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-python
dconf
debootstrap
debugedit
default-cursors
desktop-file-utils
device-mapper
dhcpcd
dialog
diffutils
dmidecode
dnsmasq
dnssec-anchors
dosfstools
double-conversion
dtc
duktape
dunst
e2fsprogs
edk2-ovmf
efibootmgr
efitools
efivar
enchant
ethtool
exfatprogs
exo
expat
eza
f2fs-tools
fakeroot
fastfetch
ffmpeg
fftw
figlet
file
filesystem
findutils
firefox
firejail
fish
flac
flex
fmt
fontconfig
frameworkintegration
frameworkintegration5
freeglut
freerdp
freetype2
fribidi
fuse-common
fuse2
fuse3
gawk
gc
gcc
gcc-libs
gcr-4
gdbm
gdk-pixbuf2
geoclue
gettext
giflib
git
github-cli
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnu-free-fonts
gnupg
gnutls
go
gobject-introspection
gobject-introspection-runtime
gperftools
gpgme
gpm
gptfdisk
graphene
graphite
grep
grim
groff
grub
gsettings-desktop-schemas
gsm
gssdp
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtk-layer-shell
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtkmm3
gtksourceview4
gufw
guile
gum
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hdparm
hicolor-icon-theme
hidapi
highway
hivex
htop
http-parser
hwdata
hyphen
hyprcursor
hyprland
hyprlang
iana-etc
icu
imagemagick
imath
imlib2
iniparser
intel-ucode
iproute2
iptables-nft
iputils
iso-codes
jack2
jansson
jbigkit
jfsutils
json-c
json-glib
jsoncpp
kaccounts-integration
karchive
karchive5
kauth
kauth5
kbd
kbookmarks
kbookmarks5
kcalendarcore
kcmutils
kcodecs
kcodecs5
kcolorscheme
kcompletion
kcompletion5
kconfig
kconfig5
kconfigwidgets
kconfigwidgets5
kcontacts
kcoreaddons
kcoreaddons5
kcrash
kcrash5
kdbusaddons
kdbusaddons5
kdecoration
kded5
keyutils
kglobalaccel
kglobalaccel5
kguiaddons
kguiaddons5
ki18n
ki18n5
kiconthemes
kiconthemes5
kidentitymanagement
kio
kio5
kirigami
kitemmodels
kitemviews
kitemviews5
kjobwidgets
kjobwidgets5
kleopatra
kmailtransport
kmbox
kmime
kmod
knewstuff
knewstuff5
knotifications
knotifications5
kpackage
kpackage5
kpimtextedit
krb5
kservice
kservice5
ksmtp
kstatusnotifieritem
ktextaddons
ktextwidgets
ktextwidgets5
kwallet
kwallet5
kwidgetsaddons
kwidgetsaddons5
kwindowsystem
kwindowsystem5
kxmlgui
kxmlgui5
l-smash
lame
lcms2
less
libaccounts-glib
libaccounts-qt
libaio
libakonadi
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libburn
libbytesize
libcaca
libcacard
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libconfig
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdeflate
libdisplay-info
libdovi
libdrm
libdv
libdvdnav
libdvdread
libedit
libei
libelf
libepoxy
libevdev
libevent
libewf
libexif
libffi
libfontenc
libgcrypt
libgirepository
libgit2
libglvnd
libgpg-error
libgtop
libgudev
libguestfs
libical
libice
libidn2
libiec61883
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libisoburn
libisofs
libjpeg-turbo
libjxl
libkgapi
libkleo
libksba
libldap
libldm
libliftoff
liblqr
libluv
libmanette
libmd
libmm-glib
libmnl
libmodplug
libmpc
libmpdclient
libnbd
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnvme
libogg
libomxil-bellagio
libopenmpt
libosinfo
libp11-kit
libpcap
libpciaccess
libpgm
libpipewire
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqalculate
libraqm
libraw1394
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsigc++
libsixel
libslirp
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libssh
libssh2
libstemmer
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtool
libtraceevent
libtracefs
libunibreak
libunistring
libunwind
liburcu
liburing
libusb
libusbmuxd
libuv
libva
libvdpau
libverto
libvirt
libvirt-glib
libvirt-python
libvorbis
libvpl
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwpe
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxdp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxpresent
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
llvm-libs
lm_sensors
lolcat
lrzip
lsd
lsof
lsscsi
lua51
lua51-lpeg
luajit
lvm2
lxappearance
lynis
lz4
lzo
lzop
m4
mailcap
make
md4c
mdadm
media-player-info
mesa
mimetreeparser
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mousepad
mpdecimal
mpfr
mpg123
mpv
msgpack-c
mtdev
mtools
mujs
multipath-tools
ncurses
ndctl
neovim
nettle
network-manager-applet
networkmanager
networkmanager-openvpn
nftables
nilfs-utils
nm-connection-editor
npth
nspr
nss
ntfs-3g
numactl
ocl-icd
oniguruma
openal
openbsd-netcat
opencore-amr
openexr
openjpeg2
openssh
openssl
openvpn
opus
orc
os-prober
osinfo-db
oxygen
oxygen5
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
papirus-icon-theme
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-data-dump
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-json
perl-libintl-perl
perl-libwww
perl-log-message
perl-log-message-simple
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-net-http
perl-net-ssleay
perl-term-readline-gnu
perl-term-ui
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
phodav
pinentry
pipewire
pixman
pkcs11-helper
pkgconf
playerctl
polkit
polkit-gnome
polkit-qt5
polkit-qt6
popt
portaudio
procps-ng
progress
psmisc
pulseaudio
pwgen
python
python-attrs
python-autocommand
python-cairo
python-cffi
python-charset-normalizer
python-click
python-colorama
python-configobj
python-cryptography
python-distro
python-docopt
python-fastjsonschema
python-gobject
python-idna
python-inflect
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jinja
python-linux-procfs
python-mako
python-markdown
python-markdown-it-py
python-markupsafe
python-mdurl
python-more-itertools
python-notify2
python-ordered-set
python-packaging
python-perf
python-pip
python-platformdirs
python-psutil
python-pycparser
python-pygments
python-pythondialog
python-pyudev
python-pywal
python-requests
python-rich
python-setuptools
python-shtab
python-six
python-termcolor
python-tomli
python-trove-classifiers
python-typeguard
python-typing_extensions
python-uc-micro-py
python-urllib3
python-validate-pyproject
python-wheel
python-yaml
qalculate-gtk
qca-qt5
qca-qt6
qemu-audio-alsa
qemu-audio-dbus
qemu-audio-jack
qemu-audio-oss
qemu-audio-pa
qemu-audio-pipewire
qemu-audio-sdl
qemu-audio-spice
qemu-base
qemu-block-curl
qemu-block-dmg
qemu-block-nfs
qemu-block-ssh
qemu-chardev-spice
qemu-common
qemu-desktop
qemu-hw-display-qxl
qemu-hw-display-virtio-gpu
qemu-hw-display-virtio-gpu-gl
qemu-hw-display-virtio-gpu-pci
qemu-hw-display-virtio-gpu-pci-gl
qemu-hw-display-virtio-vga
qemu-hw-display-virtio-vga-gl
qemu-hw-usb-host
qemu-hw-usb-redirect
qemu-hw-usb-smartcard
qemu-img
qemu-system-x86
qemu-system-x86-firmware
qemu-ui-curses
qemu-ui-dbus
qemu-ui-egl-headless
qemu-ui-gtk
qemu-ui-opengl
qemu-ui-sdl
qemu-ui-spice-app
qemu-ui-spice-core
qemu-vhost-user-gpu
qgpgme-qt6
qt5-base
qt5-declarative
qt5-multimedia
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt6-5compat
qt6-base
qt6-declarative
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-positioning
qt6-shadertools
qt6-speech
qt6-svg
qt6-translations
qt6-wayland
qt6-webchannel
qt6-webengine
qtkeychain-qt6
rav1e
readline
reflector
reiserfsprogs
rmlint
rofi
rsync
rtkit
rubberband
ruby
ruby-abbrev
ruby-base64
ruby-benchmark
ruby-bigdecimal
ruby-bundledgems
ruby-bundler
ruby-cgi
ruby-csv
ruby-date
ruby-delegate
ruby-did_you_mean
ruby-digest
ruby-drb
ruby-english
ruby-erb
ruby-etc
ruby-fcntl
ruby-fiddle
ruby-fileutils
ruby-find
ruby-forwardable
ruby-getoptlong
ruby-io-console
ruby-io-nonblock
ruby-io-wait
ruby-ipaddr
ruby-irb
ruby-json
ruby-logger
ruby-manpages
ruby-minitest
ruby-mutex_m
ruby-net-http
ruby-open-uri
ruby-optimist
ruby-paint
ruby-power_assert
ruby-psych
ruby-racc
ruby-rake
ruby-rdoc
ruby-reline
ruby-rexml
ruby-ruby2_keywords
ruby-stdlib
ruby-stringio
ruby-test-unit
ruby-time
ruby-tmpdir
ruby-uri
rubygems
sbctl
sdbus-cpp
sdl2
sdl2_image
sdl2_ttf
seabios
seatd
sed
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
sleuthkit
slurp
snappy
sndio
solid
solid5
sonnet
sonnet5
sound-theme-freedesktop
spdlog
speex
speexdsp
spice
spice-gtk
spice-protocol
spirv-tools
sqlite
squashfs-tools
srt
starship
startup-notification
strace
sudo
supermin
svt-av1
swappy
swayidle
syndication
syndication5
syntax-highlighting
sysfsutils
syslinux
systemd
systemd-libs
systemd-sysvcompat
taglib
tar
tdb
texinfo
thin-provisioning-tools
thunar
tldr
tomlplusplus
tpm2-tss
tracker3
trash-cli
tree-sitter
tree-sitter-bash
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-python
tree-sitter-query
tree-sitter-vimdoc
tslib
ttf-fira-code
ttf-fira-sans
ttf-firacode-nerd
ttf-font-awesome
tumbler
twolame
tzdata
uchardet
udisks2
ufw
unibilium
unzip
upower
usbredir
util-linux
util-linux-libs
v4l-utils
vapoursynth
vde2
vid.stab
vim
vim-runtime
virglrenderer
virt-install
virt-manager
virtiofsd
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
vulkan-validation-layers
wavpack
waybar
wayland
wayland-protocols
webkit2gtk
webkit2gtk-4.1
webrtc-audio-processing-1
wget
which
wireless_tools
wl-clipboard
wlroots
woff2
wolfssl
wpa_supplicant
wpebackend-fdo
x264
x265
xautolock
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-utils
xfconf
xfsprogs
xkeyboard-config
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xinput
xorg-xkbcomp
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yajl
yara
yyjson
zeromq
zimg
zlib
zstd
